app/Controllers/DataAbsen.php

INSERT INTO `tb_dataabsen` (`tanggal`, `waktu`, `keterangan`) VALUES ('2026-04-10', 'shubuh', '')
INSERT INTO `tb_absen` (`id_dataabsen`, `qrcode`, `status`) VALUES (11, '122204 - Agus Ramdani Alfariji', 'alfa')
SELECT *
FROM `tb_santri`
INSERT INTO `tb_absen` (`id_dataabsen`, `qrcode`, `status`) VALUES (12, '122204 - Agus Ramdani Alfariji', 'alfa')
---
    public function simpan()
    {
        $dataAbsen = new DataAbsenModel();
        $santri = new SantriModel();
        $absen = new AbsenModel();

        $data = [
            'tanggal' => $this->request->getPost('tanggal'),
            'waktu' => $this->request->getPost('waktu'),
            'keterangan' => $this->request->getPost('keterangan')
        ];

        $dataAbsen->insert($data);
        $id = $dataAbsen->insertID();

        $semuaSantri = $santri->findAll();

        foreach ($semuaSantri as $s) {
            $absen->insert([
                'id_dataabsen' => $id,
                'qrcode' => $s['qrcode'],
                'status' => 'alfa'
            ]);

SELECT *
FROM `tb_absen`
JOIN `tb_santri` ON `tb_santri`.`qrcode`=`tb_absen`.`qrcode`
WHERE `id_dataabsen` = '12'
ORDER BY `tb_santri`.`nama` ASC
---
    public function detail($id)
    {
        $db = \Config\Database::connect();

        $data['absen'] = $db->table('tb_absen')
            ->join('tb_santri', 'tb_santri.qrcode=tb_absen.qrcode')
            ->where('id_dataabsen', $id)
            ->orderBy(
                'tb_santri.nama',
                'ASC'
            )
            ->get()->getResultArray();

SELECT `tb_santri`.`nama`, `tb_santri`.`asrama`, COUNT(tb_absen.id_absen) as jumlah_alfa
FROM `tb_absen`
JOIN `tb_dataabsen` ON `tb_dataabsen`.`id_dataabsen` = `tb_absen`.`id_dataabsen`
JOIN `tb_santri` ON `tb_santri`.`qrcode` = `tb_absen`.`qrcode`
WHERE `tb_dataabsen`.`tanggal` = '2026-04-10'
AND `tb_absen`.`status` = 'alfa'
GROUP BY `tb_santri`.`nis`
HAVING `jumlah_alfa` > 0
ORDER BY `tb_santri`.`asrama` ASC, `tb_santri`.`nama` ASC
---
    public function kirimWhatsapp($tanggal)
    {
        $db = \Config\Database::connect();

        $builder = $db->table('tb_absen');
        $builder->select('tb_santri.nama, tb_santri.asrama, COUNT(tb_absen.id_absen) as jumlah_alfa');
        $builder->join('tb_dataabsen', 'tb_dataabsen.id_dataabsen = tb_absen.id_dataabsen');
        $builder->join('tb_santri', 'tb_santri.qrcode = tb_absen.qrcode');

        $builder->where('tb_dataabsen.tanggal', $tanggal);
        $builder->where('tb_absen.status', 'alfa');

        $builder->groupBy('tb_santri.nis');
        $builder->having('jumlah_alfa >', 0);

        $builder->orderBy('tb_santri.asrama', 'ASC');
        $builder->orderBy('tb_santri.nama', 'ASC');

        $data = $builder->get()->getResult();