app/Controllers/Santri.php

SELECT *
FROM `tb_santri`
---
    public function index()
    {
        $model = new SantriModel();
        $data['santri'] = $model->findAll();

SELECT *
FROM `tb_santri`
WHERE `nis` = '122204'
---
    public function detail($nis)
    {
        $db = \Config\Database::connect();

        $santri = $db->table('tb_santri')->where('nis', $nis)->get()->getRowArray();