app/Controllers/Santri.php

SELECT `kelas`
FROM `tb_santri`
GROUP BY `kelas`
SELECT `asrama`
FROM `tb_santri`
GROUP BY `asrama`
SELECT `kamar`
FROM `tb_santri`
GROUP BY `kamar`
---

        $data['santri'] = $builder->get()->getResultArray();

        $data['kelasList'] = $db->table('tb_santri')->select('kelas')->groupBy('kelas')->get()->getResultArray();
        $data['asramaList'] = $db->table('tb_santri')->select('asrama')->groupBy('asrama')->get()->getResultArray();
        $data['kamarList'] = $db->table('tb_santri')->select('kamar')->groupBy('kamar')->get()->getResultArray();

SELECT *
FROM `tb_santri`
WHERE `nis` = '123101'
---
    public function detail($nis)
    {
        $db = \Config\Database::connect();

        $santri = $db->table('tb_santri')->where('nis', $nis)->get()->getRowArray();